openfoam/k77tff6/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air water);

air
{
    diameterModel   IATE;

    IATECoeffs
    {
        dMax 1e-2;//5e-3;
        dMin 1e-4;//1e-4;
        residualAlpha 1e-6;

        sources
        (
            wakeEntrainmentCoalescence
            {
                Cwe         0.002;
            }
            randomCoalescence
            {
                Crc         0.04;
                C           3;
                alphaMax    0.75;
            }
            turbulentBreakUp
            {
                Cti         0.085;
                WeCr        6;
            }
        );
    }

    residualAlpha   1e-6;
}

water
{
    diameterModel constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type                           hyperbolic;
        maxDispersedAlpha.air          0.5;
        maxDispersedAlpha.water        0.3;
        transitionAlphaScale           0.4; 
    }
}

sigma
(
    (air and water)     0.072
);

aspectRatio
(
    (air in water)
    {
        type            constant;
        E0              1.0;
    }

    (water in air)
    {
        type            constant;
        E0              1.0;
    }
);

drag
(
    (air in water)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        Tomiyama;
            l           1.75; 
        }
    }

    (water in air)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        Tomiyama;
            l           1.75; 
        }
    }

    (air and water)
    {
        type            segregated;
        m               0.5;
        n               8;
        swarmCorrection
        {
            type        none;
            
        }
    }
);

virtualMass
(
    (air in water)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    (water in air)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
(
    (air in water)
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }

    (water in air)
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
);

lift
(
    (air in water)
    {
        type           LegendreMagnaudet;
        residualRe     1e-3; 
    }
    (water in air)
    {
        type           LegendreMagnaudet;
        residualRe     1e-3; 
    }   
);

wallLubrication
(
    (air in water)
    {
        type           Frank;
        Cwd            6.8;
        Cwc            10.0;
        p              1.7;  
    }
    (water in air)
    {
        type           Frank;
        Cwd            6.8;
        Cwc            10.0;
        p              1.7;  
    }   
);

turbulentDispersion
(
    (air in water)
    {
        type           Gosman;
        sigma          0.9;
        
    }
    (water in air)
    {
        type           Gosman;
        sigma          0.9;
        
    }   
);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
