openfoam/k77tff6/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    opening
    {
        type               calculated;
        value              $internalField; 
    }
    
    
	
	
    outlet
    {
        type               calculated;
        value              $internalField; 
    }
    
    "plate.*"
    {
        type               calculated;
        value              $internalField; 
    }
	
    "pipe.*"
    {
        type               calculated;
        value              $internalField; 
    }
	
    "rib.*"
    {
        type               calculated;
        value              $internalField; 
    }
	
    "wall.*"
    {
       type               calculated;
       value              $internalField; 
    }
    
     
	
}

// ************************************************************************* //
