openfoam/k77tff6/0/Theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    opening
    {
        type            inletOutlet;
        inletValue      uniform 1.0e-7;
        value           uniform 1.0e-7; 
    }
     	
		
    outlet
    {
        type            zeroGradient; 
    }
        
    "plate.*"
    {
        type            zeroGradient; 
    }
	
	"pipe.*"
    {
        type            zeroGradient; 
    }
	
	"rib.*"
    {
        type            zeroGradient; 
    }
	
    "wall.*"
    {
        type            zeroGradient; 
    }
	    
		
}

// ************************************************************************* //
