openfoam/k77tff6/0/alpha.air.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    opening
    {
        type	inletOutlet;
	    inletValue	uniform 1.0;
	    phi	        phi.air; 
    }
    
    
	
    outlet
    {
        type            zeroGradient; 
    }
	    
    "plate.*"
    {
        type            zeroGradient; 
    }
	
	"pipe.*"
    {
        type            zeroGradient; 
    }
	
    "rib.*"
    {
        type            zeroGradient; 
    }
    "wall.*"
    {
       type            zeroGradient; 
    }
    
     
	
}

// ************************************************************************* //
