openfoam/k77tff6/0/epsilonm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilonm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-4;

boundaryField
{
   opening
    {
        type            inletOutlet;
	    phi             phim.water;
        inletValue      $internalField;
        value           $internalField;
    }
    
    	
	
	
    outlet
    {
        type            zeroGradient;
        value           $internalField;
    }
       
    "plate.*"
    {
        type            zeroGradient;
        value           $internalField;
    }
	
    "pipe.*"
    {
        type            zeroGradient;
        value           $internalField;
    }
	
     "rib.*"
    {
        type            zeroGradient;
        value           $internalField;
    }
	
    "wall.*"
    {
        type            zeroGradient;
        value           $internalField;
    }
	
    
	
	
}


// ************************************************************************* //
