openfoam/k77tff6/0/k.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    opening
    {
        type            inletOutlet;
	phi             phi.air;
        inletValue      $internalField;
        value           $internalField; 
    }
   
    
	
    outlet
    {
        type            zeroGradient;
        
    }
    
    "plate.*"
    {
        type            kqRWallFunction;
        value           $internalField; 
    }
	
     "pipe.*"
    {
        type            kqRWallFunction;
        value           $internalField; 
    }
	
    "rib.*"
    {
        type            kqRWallFunction;
        value           $internalField; 
    }
     "wall.*"
    {
        type            kqRWallFunction;
        value           $internalField; 
    }
        
}


// ************************************************************************* //
