openfoam/k77tff6/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



defaultFieldValues
(
    volScalarFieldValue alpha.air 0
);

regions
(
    //boxToCell
    //{
    //    box (0 0 -1) ($s $depth 1);
    //    fieldValues
    //    (
    //        volScalarFieldValue alpha.air 0
    //    );
    //}
);


// ************************************************************************* //
