openfoam/k77tff6/Allrun
setFields
decomposePar
mpirun -np 39 renumberMesh -overwrite -parallel
mpirun -np 39 twoPhaseEulerFoam -parallel
reconstructPar
